narfu-serialize/src/DataProcessors/ВыгрузкаXML/ВыгрузкаXML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаXML</name>
  <attributes>
    <name>КаталогСохранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

narfu-serialize/src/Documents/Бронирование/Бронирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Бронирование</name>
  <attributes>
    <name>ДатаЗаезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНомера</name>
    <type>
      <types>CatalogRef.ТипыНомеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Постояльцы</name>
    <attributes>
      <name>Постоялец</name>
      <type>
        <types>CatalogRef.Постояльцы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

narfu-serialize/src/DataProcessors/ВыгрузкаXML/Forms/Форма/Module.bsl
&НаКлиенте
Процедура КаталогСохраненияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)      
	
	СтандартнаяОбработка = Ложь;
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	Проводник.Заголовок = "Выберите каталог для загрузки файла";
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(Оповещение);
	
	
КонецПроцедуры          

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;      
	
	Объект.КаталогСохранения = ВыбранныеФайлы[0];
	
КонецПроцедуры 

#Область ВыгрузкаПостояльцы 

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Постояльцы.Наименование КАК Наименование,
	|	Постояльцы.Телефон КАК Телефон,
	|	Постояльцы.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты,
	|	Постояльцы.ДатаРождения КАК ДатаРождения,
	|	Постояльцы.Пол КАК Пол,
	|	Постояльцы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Постояльцы КАК Постояльцы";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ЭтотОбъект.ВыгружаемыеДанные.Загрузить(РезультатЗапроса);
		
	//УИД = ВыгружаемыеДанные.Ссылка.УникальныйИдентификатор();
	//Сообщить(УИД); 

	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	ЗаписатьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	Элемент = Новый ЗаписьXML;
	
	Элемент.ОткрытьФайл(Объект.КаталогСохранения + "/СписокПостояльцы.xml");
	
	Элемент.ЗаписатьОбъявлениеXML();
	
	Элемент.ЗаписатьНачалоЭлемента("Постояльцы");
	
	//XMLЗначение(Тип("УникальныйИдентификатор"), 
	
	Для Каждого Постоялец из ВыгружаемыеДанные Цикл 
		
		Элемент.ЗаписатьНачалоЭлемента("Постоялец");
		
		Элемент.ЗаписатьНачалоЭлемента("ФИО");
		Элемент.ЗаписатьТекст(Постоялец.Наименование); 
		Элемент.ЗаписатьКонецЭлемента(); 
			
		Элемент.ЗаписатьНачалоЭлемента("Ссылка");
		Элемент.ЗаписатьТекст(Строка(Постоялец.Ссылка.УникальныйИдентификатор())); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Телефон");
		Элемент.ЗаписатьТекст(Постоялец.Телефон); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Почта");
		Элемент.ЗаписатьТекст(Постоялец.АдресЭлектроннойПочты); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Пол");
		Элемент.ЗаписатьТекст(Постоялец.Пол); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("ДатаРождения");
		Элемент.ЗаписатьТекст(XMLСтрока(Постоялец.ДатаРождения)); 
		Элемент.ЗаписатьКонецЭлемента();  
		
		Элемент.ЗаписатьКонецЭлемента();
		
	КонецЦикла;             
		
	Элемент.ЗаписатьКонецЭлемента();
	
	Элемент.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаТипыНомеров

&НаСервере
Процедура ЗаписатьДанныеДляТиповНомеровНаСервере()  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТипыНомеров.Наименование КАК Наименование,
	|	ТипыНомеров.Код КАК Код,
	|	ТипыНомеров.Количество КАК Количество,
	|	ТипыНомеров.Цена КАК Цена,
	|	ТипыНомеров.Описание КАК Описание,
	|	ТипыНомеров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТипыНомеров КАК ТипыНомеров";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();     
	
	
	
	
	ЭтотОбъект.ВыгружаемыеДанныеТипыНомеров.Загрузить(РезультатЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеДляТиповНомеров(Команда)
	ЗаписатьДанныеДляТиповНомеровНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанныеДляТиповНомеров(Команда)
	Элемент = Новый ЗаписьXML;
	
	Элемент.ОткрытьФайл(Объект.КаталогСохранения + "/СписокТипыНомеров.xml");
	
	Элемент.ЗаписатьОбъявлениеXML();
	
	Элемент.ЗаписатьНачалоЭлемента("ТипыНомеров");
	
	Для Каждого ТипНомера из ВыгружаемыеДанныеТипыНомеров Цикл 
		Элемент.ЗаписатьНачалоЭлемента("ТипНомера");
		
		Элемент.ЗаписатьНачалоЭлемента("Наименование");
		Элемент.ЗаписатьТекст(ТипНомера.Наименование); 
		Элемент.ЗаписатьКонецЭлемента(); 
		
		Элемент.ЗаписатьНачалоЭлемента("Ссылка");
		Элемент.ЗаписатьТекст(Строка(ТипНомера.Ссылка.УникальныйИдентификатор()));
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Код");
		Элемент.ЗаписатьТекст(XMLСтрока(ТипНомера.Код)); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Количество");
		Элемент.ЗаписатьТекст(XMLСтрока(ТипНомера.Количество)); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Цена");
		Элемент.ЗаписатьТекст(XMLСтрока(ТипНомера.Цена)); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Описание");
		Элемент.ЗаписатьТекст(ТипНомера.Описание); 
		Элемент.ЗаписатьКонецЭлемента();  
		
		Элемент.ЗаписатьКонецЭлемента();     
			
	КонецЦикла; 
		
	Элемент.ЗаписатьКонецЭлемента();
	
	Элемент.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаБронирования 

 &НаКлиенте
Процедура ВыгрузитьДанныеДляБронирования(Команда)
	Элемент = Новый ЗаписьXML;
	
	Элемент.ОткрытьФайл(Объект.КаталогСохранения + "/СписокБронирований.xml");
	
	Элемент.ЗаписатьОбъявлениеXML();
	
	Элемент.ЗаписатьНачалоЭлемента("Бронирования");
		
	Для Каждого Бронь из ВыгружаемыеДанныеБронирования Цикл
		
		Элемент.ЗаписатьНачалоЭлемента("Бронирование");
		
		Элемент.ЗаписатьНачалоЭлемента("Дата");
		Элемент.ЗаписатьТекст(XMLСтрока(Бронь.Дата)); 
		Элемент.ЗаписатьКонецЭлемента();
			
		Элемент.ЗаписатьНачалоЭлемента("Ссылка");
		Элемент.ЗаписатьТекст(Строка(Бронь.Ссылка.УникальныйИдентификатор()));
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Номер");
		Элемент.ЗаписатьТекст(XMLСтрока(Бронь.Номер)); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("ДатаЗаезда");
		Элемент.ЗаписатьТекст(XMLСтрока(Бронь.ДатаЗаезда)); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("ДатаВыезда");
		Элемент.ЗаписатьТекст(XMLСтрока(Бронь.ДатаВыезда)); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("ТипНомера");
		Элемент.ЗаписатьТекст(XMLСтрока(Бронь.ТипНомера)); 
		Элемент.ЗаписатьКонецЭлемента();       
		
		Элемент.ЗаписатьКонецЭлемента();
		
	КонецЦикла;
		
	Элемент.ЗаписатьКонецЭлемента();
	
	Элемент.Закрыть();

КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеДляБронированияНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Бронирование.Дата КАК Дата,
	|	Бронирование.Номер КАК Номер,
	|	Бронирование.ДатаЗаезда КАК ДатаЗаезда,
	|	Бронирование.ДатаВыезда КАК ДатаВыезда,
	|	Бронирование.ТипНомера КАК ТипНомера,
	|	Бронирование.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Бронирование КАК Бронирование";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ЭтотОбъект.ВыгружаемыеДанныеБронирования.Загрузить(РезультатЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеДляБронирования(Команда) 
	
	ЗаписатьДанныеДляБронированияНаСервере();    
	
КонецПроцедуры

#КонецОбласти  

&НаКлиенте
Процедура ВыгрузитьВсеДанные(Команда)
	Элемент = Новый ЗаписьXML;
	
	Элемент.ОткрытьФайл(Объект.КаталогСохранения + "/ПолныйСписок.xml");
	
	Элемент.ЗаписатьОбъявлениеXML();
	
	Элемент.ЗаписатьНачалоЭлемента("ПолныйСписок");
	
	Элемент.ЗаписатьНачалоЭлемента("ТипыНомеров");
	
	Для Каждого ТипНомера из ВыгружаемыеДанныеТипыНомеров Цикл 
		
		Элемент.ЗаписатьНачалоЭлемента("ТипНомера");
		
		Элемент.ЗаписатьНачалоЭлемента("Наименование");
		Элемент.ЗаписатьТекст(ТипНомера.Наименование); 
		Элемент.ЗаписатьКонецЭлемента();  
			
		Элемент.ЗаписатьНачалоЭлемента("Ссылка");
		Элемент.ЗаписатьТекст(Строка(ТипНомера.Ссылка.УникальныйИдентификатор())); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Код");
		Элемент.ЗаписатьТекст(XMLСтрока(ТипНомера.Код)); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Количество");
		Элемент.ЗаписатьТекст(XMLСтрока(ТипНомера.Количество)); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Цена");
		Элемент.ЗаписатьТекст(XMLСтрока(ТипНомера.Цена)); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Описание");
		Элемент.ЗаписатьТекст(ТипНомера.Описание); 
		Элемент.ЗаписатьКонецЭлемента();  
		
		Элемент.ЗаписатьКонецЭлемента();     
				
	КонецЦикла;
	
	Элемент.ЗаписатьКонецЭлемента();
	
	Элемент.ЗаписатьНачалоЭлемента("Постояльцы");
	
	Для Каждого Постоялец из ВыгружаемыеДанные Цикл 
		
		Элемент.ЗаписатьНачалоЭлемента("Постоялец");
		
		Элемент.ЗаписатьНачалоЭлемента("ФИО");
		Элемент.ЗаписатьТекст(XMLСтрока(Постоялец.Наименование)); 
		Элемент.ЗаписатьКонецЭлемента();
			
		Элемент.ЗаписатьНачалоЭлемента("Ссылка");
		Элемент.ЗаписатьТекст(Строка(Постоялец.Ссылка.УникальныйИдентификатор())); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Телефон");
		Элемент.ЗаписатьТекст(XMLСтрока(Постоялец.Телефон)); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Почта");
		Элемент.ЗаписатьТекст(XMLСтрока(Постоялец.АдресЭлектроннойПочты)); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Пол");
		Элемент.ЗаписатьТекст(XMLСтрока(Постоялец.Пол)); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("ДатаРождения");
		Элемент.ЗаписатьТекст(XMLСтрока(Постоялец.ДатаРождения)); 
		Элемент.ЗаписатьКонецЭлемента();  
		
		Элемент.ЗаписатьКонецЭлемента();
		
		
	КонецЦикла;
	
	Элемент.ЗаписатьКонецЭлемента();
	
	Элемент.ЗаписатьНачалоЭлемента("Бронирования");
		
	Для Каждого Бронь из ВыгружаемыеДанныеБронирования Цикл 
		
		Элемент.ЗаписатьНачалоЭлемента("Бронирование");
		
		Элемент.ЗаписатьНачалоЭлемента("Дата");
		Элемент.ЗаписатьТекст(XMLСтрока(Бронь.Дата)); 
		Элемент.ЗаписатьКонецЭлемента();
			
		Элемент.ЗаписатьНачалоЭлемента("Ссылка");
		Элемент.ЗаписатьТекст(Строка(Бронь.Ссылка.УникальныйИдентификатор())); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("Номер");
		Элемент.ЗаписатьТекст(XMLСтрока(Бронь.Номер)); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("ДатаЗаезда");
		Элемент.ЗаписатьТекст(XMLСтрока(Бронь.ДатаЗаезда)); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("ДатаВыезда");
		Элемент.ЗаписатьТекст(XMLСтрока(Бронь.ДатаВыезда)); 
		Элемент.ЗаписатьКонецЭлемента();
		
		Элемент.ЗаписатьНачалоЭлемента("ТипНомера");
		Элемент.ЗаписатьТекст(XMLСтрока(Бронь.ТипНомера)); 
		Элемент.ЗаписатьКонецЭлемента();  
		
		Элемент.ЗаписатьКонецЭлемента();
		
	КонецЦикла;             

	Элемент.ЗаписатьКонецЭлемента();
	
	Элемент.ЗаписатьКонецЭлемента();
	
	Элемент.Закрыть(); 
	
КонецПроцедуры
